app/Services/NotifiService.php

select * from `tb_notif` where (`user_id` = 1 and `is_read` = 0 and `month` = '11' and `year` = '2025') group by `departemen`, `user_id` order by `created_at` desc
---
    public static function getActiveNotification()
    {
        $currentMonth = date('n');
        $currentYear = date('Y');

        $notif = Notif::where([
            ['user_id', auth()->user()->id],
            ['is_read', 0],
            ['month', $currentMonth],
            ['year', $currentYear]
        ])
            ->groupBy('departemen', 'user_id')
            ->orderBy('created_at', 'desc')
            ->get();