app/Http/Controllers/IA/IA1ProgramAuditInternalController.php

select * from `program_audit_internals` where `tahun` = '2025'
select * from `bulan`
---
    public function print(Request $r)
    {
        $datas = ProgramAuditInternal::where('tahun', $r->tahun)->get();

        $datas = [
            'title' => 'PROGRAM AUDIT INTERNAL',
            'dok' => 'Dok.No.: FRM.IA.01.01, Rev.00',
            'tahun' => $r->tahun,
            'datas' => $datas,
            'bulan' => DB::table('bulan')->get(),