app/Livewire/Ia/ProgramAuditInternal.php

select * from `tb_notif` where (`nama` = 'Gudang Bahan Baku - PPC' and `month` = 1 and `year` = '2025' and `user_id` = 1 and `is_read` = 1) limit 1
---
    public function cekSelesai($nama, $month)
    {
        $cek = Notif::where([
            ['nama', $nama],
            ['month', $month],
            ['year', $this->tahun],
            ['user_id', auth()->user()->id],
            ['is_read', 1]
        ])->first();

select * from `program_audit_internals` where `tahun` = '2025'
---
    public function render()
    {
        $departemenBk = Divisi::get()->pluck('divisi');
        $user = DataPegawai::karyawan()->get();

        $data = [
            'datas' => ModelsProgramAuditInternal::where('tahun', $this->tahun)->get(),
            'departemenBk' => $departemenBk,
            'user' => $user,
        ];