app/helpers.php

    function whereTtd($where)
    {
        return DataPegawai::where('posisi', 'LIKE', "%{$where}%")->first()->karyawan_id_dari_api;
---
select * from `data_pegawais` where `posisi` LIKE '%KEPALA CABUT%' limit 1

    function pengawasTtd($pengawas)
    {
        return DataPegawai::where('nama', $pengawas)->first();
---
select * from `data_pegawais` where `nama` = 'Siti Patimah' limit 1