app/Http/Controllers/Produksi/Pro3FormPencabutanBulu.php

select `sbw_kotor`.*, `grade_sbw_kotor`.`nama` as `grade_nama`, `sbw_kotor`.`no_invoice` from `sbw_kotor` left join `grade_sbw_kotor` on `sbw_kotor`.`grade_id` = `grade_sbw_kotor`.`id` where (`nm_partai` like '%Bjm 997%' or `nm_partai` like '%Bjm 998%' or `nm_partai` like '%Bjm 999%' or `nm_partai` like '%Bjm 1000%' or `nm_partai` like '%BJM 1002%' or `nm_partai` like '%bjm 1003%')
---
    public function print(Request $r)
    {
        // Ambil data utama dari API
        $cabut = Http::get("https://sarang.ptagafood.com/api/apihasap/cabut_pengeringan_new_detail?id_pengawas=$r->id_pengawas")
            ->json()['data'] ?? [];

        if (!$cabut) {
            return "Data API kosong";
        }

        // --- 1. Ambil semua nm_partai unik untuk sbw_kotor ---
        $nmPartaiList = collect($cabut)->pluck('nm_partai')->unique()->toArray();

        $sbwList = DB::table('sbw_kotor')
            ->leftJoin('grade_sbw_kotor', 'sbw_kotor.grade_id', '=', 'grade_sbw_kotor.id')
            ->where(function ($q) use ($nmPartaiList) {
                foreach ($nmPartaiList as $nm) {
                    $q->orWhere('nm_partai', 'like', '%' . $nm . '%');
                }
            })
            ->select(
                'sbw_kotor.*',
                'grade_sbw_kotor.nama as grade_nama',
                'sbw_kotor.no_invoice'
            )
            ->get()
            ->groupBy('nm_partai');